[["Man gets 9-11 years for raping girl in park", "https://www.salemnews.com/news/local_news/man-gets-9-11-years-for-raping-girl-in-park/article_9ef6e707-36a0-5b61-9ef1-141ebcdf6fc2.html", "MARBLEHEAD — A Marblehead man convicted earlier this month of raping an  eighth-grader after buying alcohol for her and another girl was...", "Nov 30, 2011", "Skip to main content\n\nYou have permission to edit this article.\n\nEdit\n\nClose\n\nFacebook\n\nTwitter\n\nEmail\n\nSearch\n\nSUBSCRIBE\n\nLOGIN\n\nNews\n\nLocal News\n\nState News\n\nCommunity News\n\nNational & World News\n\nBusiness\n\nLifestyles\n\nTV Listings\n\nSpecial Sections\n\nEXPLORE the Niagara Frontier\n\nPuzzles, Comics & Games\n\nComics\n\nPuzzles\n\nGames\n\nSports\n\nSports Special\n\nNational Sports\n\nSports Betting\n\nCan you beat Burt?\n\nOpinion\n\nColumns\n\nEditorials\n\nLetters to the editor\n\nMagazines\n\nCommunity\n\nCelebrations\n\nPhotos\n\nSubmit a celebration\n\nClassifieds\n\nJobs\n\nAutos\n\nHomes\n\nPlace An Ad\n\nLocal public notices\n\nMassachusetts public notices\n\nSubmit a Public Notice\n\nCelebrations\n\nObituaries\n\nE-Edition\n\nApp\n\nPublic Notices\n\nContact Us\n\nPurchase Photos\n\nSubmit a Letter to the Editor\n\nSubmit a News Tip\n\nPlace an Obituary\n\nSubscribe\n\nStart a Subscription\n\nManage My Subscription\n\nE-Paper\n\nApp Downloads\n\nNewsletter\n\nSalem News Carrier Route Opportunities\n\nShop\n\nCoupons\n\nWeekly Ads\n\nNewspaper Ads\n\nSearch\n\nContact Us\n                \n                \n                    Purchase Photos\n                \n                \n                    Submit a Letter to the Editor\n                \n                \n                    Submit a News Tip\n                \n                \n                    Place an Obituary\n                \n                \n                    Carrier Routes Available\n\nSUBSCRIBE\n                \n                \n                    Start a Subscription\n                \n                \n                    Manage My Subscription\n                \n                \n                    Magazine Subscription\n                \n                \n                    E-Paper\n                \n                \n                    App Downloads\n                \n                \n                    Newsletter\n\nLogin\n\nAbout Us\n                \n                \n                    Contact Us\n                \n                \n                    Advertise with Us\n\nE-Edition\n\nEvents Calendar\n                \n                \n                    See All Events\n                \n                \n                    Add Your Event\n\nCelebrations\n\nObituaries\n                \n                \n                    Submit an Obituary\n                \n                \n                    Submit a Memoriam\n\nPublic Notices\n                \n                \n                    Local Public Notices\n                \n                \n                    Massachusetts Public Notices\n                \n                \n                    Submit a Public Notice\n\nSpecial Sections\n\nPuzzles\n\nMan gets 9-11 years for raping girl in park\n\nShare this\n\n65°\r\n                    \r\n                \r\n                \r\n            \r\n            \r\n                \r\n                    \r\n                        \r\n                            \r\n                                \r\n                                \r\n                            \r\n\r\n                            \r\n                                \r\n                                    Danvers, MA\r\n                                \r\n                                (01923)\r\n                            Today\r\n                                Partly cloudy. High 86F. Winds NE at 5 to 10 mph..\r\n                                \r\n                                Tonight\r\n                                A few clouds. Low 68F. Winds light and variable.\r\n                                 Updated: September 5, 2023 @ 5:56 am\r\n                    \r\n                    \r\n                    \r\n                         Full Forecast\n\nTuesday, September 5, 2023\n\nE-Edition\n\nNewsletter\n\nFacebook\n\nTwitter\n\nMan gets 9-11 years for raping girl in park\n\nBy Julie ManganisStaff writer\r\n        \r\n        \r\n            \r\n        \r\n            Nov 30, 2011\r\n        \r\n            \r\n        Nov 30, 2011\n\nMARBLEHEAD — A Marblehead man convicted earlier this month of raping an eighth-grader after buying alcohol for her and another girl was sentenced to nine to 11 years in state prison yesterday.\n\nJohn Murphy, 24, was found guilty two weeks ago of child rape and providing alcohol to minors following a weeklong trial in Lawrence Superior Court.\n\nYesterday, Judge Richard Welch III sentenced Murphy to spend at least nine years in prison for the crimes, to be followed by five years of probation.\n\nMurphy has also been barred from any contact with the victim, her family and friends and any other witnesses in the case, as well as from any contact with children under 16. He was ordered to wear a GPS monitoring bracelet after his release; must complete both drug and alcohol treatment, as well as sex offender treatment; and will be subject to random tests for drugs and alcohol, according to the district attorney's office and the court clerk.\n\nProsecutor Karen Hopwood, who had sought a longer prison term of 12 to 14 years, said the victim and her friends met Murphy on the Gerry School playground in Marblehead on the evening of June 12, 2009.\n\nThe girls, who were 14 at the time, asked Murphy to purchase alcohol for them, which he did, providing them with Jé§germeister and Goldschlé§ger and then inviting them back to a home where he was housesitting.\n\nMurphy made drinks for the girls. The victim acknowledged on the stand that she had also taken some of her mother's Klonopin pills.\n\nShe became highly intoxicated from the combination.\n\nAfter the girls decided to leave to meet their friends at Marblehead's Crocker Park, Murphy, at the time eight years older than the teenagers, decided to join them.\n\nAt Crocker Park, Murphy raped the girl, an attack eventually interrupted by one of her friends and an older couple who had gone to the park after dinner.\n\nThe girl was only semiconscious and had been vomiting throughout the incident. She ended up being hospitalized in Boston as a result of the acute intoxication. A nurse found evidence of injuries consistent with a sexual assault.\n\nThe victim's mother, in an interview after the verdict, described her daughter as bookish and shy and said the incident has changed her.\n\nDefense lawyer Alex Cain had requested a shorter, four- to seven-year term for Murphy.\n\nCourts reporter Julie Manganis may be reached at 978-338-2521 or jmanganis@salemnews.com.\n\nTags\n\nUniqueid=sn5220173;\n\nTrending Video\n\nRecommended for you\n\nFeatured Local Savings\n\nCOUPON DEALS\n\nNEWSPAPER ADS\n\nGet your rewards\n\nHome delivery and Digital Access customers of The Salem News get deals for restaurants, hotels, attractions and other businesses, locally and across the country.\n\nTrending Recipes\n\nThe Salem News Podcasts\n\nCheck out our series of podcasts on topics from high school football to Halloween in Salem.\n\n\n\n\n\n\n\nUpdate Required\n\nTo play the media you will need to either update your browser to a recent version or update your Flash plugin.\n\nThis Week's Circulars\n\nSpecial Sections\n\nSenior Living\n\nBeverly Arts Fest 2023\n\nSummer Guide 2023\n\nObituaries\n\nSteve  Andreadakis\n\nNolan Christopher Kearney\n\nRichard \"Jeff\" Jeffrey Reilly\n\nJoh"], ["Daughter welcomes court's decision not to reduce rapist father's 18-year \njail term", "https://www.breakingnews.ie/ireland/daughter-welcomes-courts-decision-not-to-reduce-rapist-fathers-18-year-jail-term-1326018.html", "John Murphy (65), a former member of the Defence Forces, previously pleaded  guilty to numerous counts of rape, indecent and sexual assault...", "Jun 27, 2022", "\n\n\n\n\n\nIreland\n\nWorld\n\nEntertainment\n\nLifestyle\n\nSport\n\nBusiness\n\nMore\n\n\n\n\n\n\n\n\nData tracker\n\n\n\n\nLotto\n\n\n\n\nWeather\n\n\n\n\nDay At A Glance\n\n\n\n\nHoroscopes\n\n\n\n\nQuiz\n\n\n\n\nSpecial Report\n\n\n\n\nSponsored\n\n\n\n\nAdvertising Feature\n\nJobs\n\nProperty\n\nData tracker\n\nExplained\n\nClimate\n\nExtra time\nPen.\n\nAdvertisement\n\nDaughter welcomes court's decision not to reduce rapist father’s 18-year jail term\n\nireland\n\nShare this article\n\nPeter Doyle\n\nA child sexual abuse survivor who had encouraged other victims to “stand tall and speak out” today welcomed the decision by the Court of Appeal not to reduce the 18-year jail term handed down to her rapist father who began to sexually assault her when she was only three.\n\nIn June 2018, John Murphy (65), a former member of the Defence Forces, pleaded guilty to numerous counts of rape, indecent and sexual assault against his daughter Sophia at locations in Co Galway and Co Mayo on dates between 1988 and 2001 when she was aged between three and 15.\n\nAdvertisement\n\nHe also pleaded guilty to one count of sexual assault against Ms Murphy, carried out in 2010.\n\nHe was sentenced to consecutive terms totalling 18 years for the offences by Mr Justice Michael White at the Central Criminal Court in July 2018.\n\nAdvertisement\n\nMr Justice White said the headline term for the offences, which he had described as “depraved”, was life.\n\nMurphy, formerly of Nephin View Manor, Foxford, Co Mayo, had appealed the sentence on the grounds it was “excessive, disproportionate, and unfair in all the circumstances”.\n\nAdvertisement\n\nBut in a judgment delivered today by Ms Justice Aileen Donnelly, Murphy’s attempt to have his jail time reduced was rejected.\n\nSpeaking outside the Court of Appeal, Ms Murphy – who attended the hearing – said that she hoped the judgment would encourage other victims of sexual abuse to come forward.\n\n“When I first heard my father was appealing his sentence, I was gutted. And to sit through the evidence again today made me feel sick,” said Ms Murphy, who had waived her right to anonymity so her father could be named.\n\n“Seeing my father again was also intimidating but I eventually managed to block him from my mind.”\n\nAdvertisement\n\n“I was worried he would get the sentence reduced, and if that happened it would be as if no one had believed me,” she continued.\n\n“All victims feel like that, and they don’t think anyone will believe them. So, I hope this judgment encourages others to come forward in the belief that they will be listened to and believed.”\n\nSister\n\nAdvertisement\n\nShe also said that her thoughts were with her sister Stephanie [Prendergast], who was another of her father’s victims and who died from a brain haemorrhage last August.\n\n“But she also suffered from issues with her mental health as a result of the abuse she suffered,” Ms Murphy added.\n\nAdvertisement\n\n“I was relieved and delighted with the judgment today, not just for her, or for me, but for all victims of this type of abuse.”\n\nIn her judgment, Ms Justice Donnelly, sitting with Mr Justice George Birmingham, presiding, and Ms Justice Isobel Kennedy, said the abuse Ms Murphy suffered from her father represented the “ultimate breach of trust of a parent”.\n\nShe said the aggravating factors in the case were the victim’s age and the abuse of trust, and that the court could find “no error in principle” in the total sentence imposed by Mr Justice White.\n\nAs the judge read an excerpt from Ms Murphy’s victim impact statement, Ms Justice Donnelly said Ms Murphy had “eloquently” expressed the physical and psychological damage that the years of abuse had had on her.\n\nAdvertisement\n\n“Dad, you stripped me of every human right. My worth, my privacy, my energy, my time, my confidence, my innocence, my childhood, my education, my teenage years, a normal life, even my own voice - until today,” Ms Murphy had told her father as he sat in the dock awaiting sentence, Ms Justice Donnelly had observed.\n\nAdvertisement\n\nEarlier, Brendan Grehan SC, for the appellant, said his client’s “essential complaint” was that the sentence imposed was too long.\n\nMr Grehan said it was his submission that the sentencing judge “did not afford sufficient weight to the mitigation in this case” such as admissions of guilt and an indication of an early plea to prosecutors during the investigation.\n\nA guilty plea was subsequently “entered at the earliest possible stage at the Central Criminal Court”, counsel added.\n\nMr Grehan said his client’s early plea was not only beneficial to the “operation of the criminal justice system”, which he described as being “particularly congested at this time”, but was also of benefit to the victim in this case.\n\n“The proportionality principle, in my view, does not seem to have been at work in this case,” he said.\n\n\"While I accept this was a serious case, and it called for a serious sentence, the sentence of 18 years in this particular case was excessive – and this court should act.”\n\nPatrick Reynolds BL, for the Director of Public Prosecutions, told the court the sentence imposed had reflected “the seriousness and prolonged period of the offending”.\n\n“It comes down to whether the learned sentencing judge took the concepts of proportionality and totality into account. In my respectful submission, he clearly did,” he said.\n\nChildhood\n\nAdvertisement\n\nBefore Murphy’s arrest, Ms Murphy had given Garda Thomasina McHale a 110-page written statement outlining the details of her father’s abuse.\n\nShe told Gda McHale that the abuse occurred initially at family homes in Co Galway, as well as later in Co Mayo. She was also sexually abused in the family car while on the way to visit her grandmother.\n\nIn her statement, Ms Murphy told gardaí that throughout her childhood, there had been constant grabbing and touching. Her father – who was aged between 31 and 44 at the time of the offending – would grab her behind or breasts numerous times during the day.\n\nMs Murphy told gardaí she could not explain how often the sexual abuse happened, she said it was horrendous and happened at every opportunity. She said that her father had all the control.\n\nShe said she had been sexually abused on Christmas Day, when a friend was in the house, and one time when her baby sister was present. She said Murphy even abused her wearing his army uniform.\n\nMurphy was arrested in October 2016 and interviewed by gardaí. He admitted sexually abusing his daughter two or three times per week and raping her when she was about 13 or 14 years old.\n\nAt his sentencing hearing, it emerged Murphy had 73 previous convictions for the sexual assault of four victims and was serving an eight-year sentence for sexual abuse involving Ms Murphy's two younger sisters.\n\nVideo news\n\nVideo: Woman jailed for harassing former TD, fraud...\n\nRead More\n\nIn her victim impact statement, Ms Murphy said: “Abusers control, manipulate you and make you feel like you are the one with the problem.”\n\nAnd she urged victims to “stand tall, speak out and take back your life, you are no"], ["Man jailed for eight years for sexual abuse and rape of younger brother", "https://www.irishtimes.com/news/crime-and-law/courts/criminal-court/man-jailed-for-eight-years-for-sexual-abuse-and-rape-of-younger-brother-1.4055261", "John Murphy 'cruelly violated' relationship with his brother in the family  home.", "Oct 18, 2019", "Home\n\nLatest\n\nSubscriber Only\n\nIrelandDublinEducationHousing & PlanningSocial AffairsStardust\n\nPoliticsOireachtas\n\nOpinionEditorialsAn Irish DiaryLettersCartoon\n\nBusinessEconomyFarming & FoodFinancial ServicesInnovationMarketsWorkCommercial Property\n\nWorldEuropeUKUSCanadaAustraliaAfricaAmericasAsia-PacificMiddle East\n\nSportGaelic GamesRugbySoccerGolfRacingAthleticsBoxingCyclingHockeyTennis\n\nYour MoneyPricewatchBudget 2023\n\nCrime & LawCourts\n\nPropertyResidentialCommercial PropertyInteriors\n\nFoodDrinkRecipesRestaurants\n\nHealthYour FamilyYour FitnessYour WellnessGet Running\n\nLife & StyleFashionFine Art & AntiquesGardeningPeopleTravel\n\nCultureArtBooksFilmMusicStageTV & Radio\n\nEnvironmentClimate Crisis\n\nTechnologyBig TechConsumer TechData & SecurityGaming\n\nScienceSpace\n\nMedia\n\nAbroad\n\nObituaries\n\nTransport\n\nMotorsCar Reviews\n\nListen\n\nPodcastsGUBUBorderlinesInside PoliticsIn the NewsThe Women's PodcastInside BusinessRoss O'Carroll-KellyAtlantic\n\nVideo\n\nPhotography\n\nHistoryCenturyBelfast Agreement\n\nTuarascáil\n\nStudent Hub\n\nOffbeat\n\nCrosswords & PuzzlesCrosaireSimplexSudoku\n\nFamily Notices(Opens in new window)\n\nSponsoredAdvertising FeatureSpecial Reports\n\nSubscriber Rewards\n\nCompetitions\n\nWeather Forecast\n\n\n\nCourts\n\nMan jailed for eight years for sexual abuse and rape of younger brother\n\nJohn Murphy ‘cruelly violated’ relationship with his brother in the family home\n\nExpand\n\nJohn Murphy (45) formerly of Waterfall, Co Cork pleaded guilty last April to twelve sample counts including three of oral rape.\n\nDeclan Brennan\n\nFri Oct 18 2019 - 14:59\n\nA man has been jailed for eight years for the repeated sexual abuse and rape of his younger brother.\n\nOver the course of a decade John Murphy abused his brother who was aged between ten and 20 years old. The abuse took place in the family home in a town in Cork between 1988 and 1997.\n\nThe Central Criminal Court heard that the victim, now aged in his 40s, wished to waive his anonymity so that his abuser could be identified.\n\nMurphy (45) formerly of Waterfall, Co Cork pleaded guilty last April to twelve sample counts including three of oral rape.\n\nREAD MORE\n\nOn Friday, Mr Justice Michael White said Murphy used his younger brother for sexual gratification and that this had a devastating impact on the victim. He described the breach of trust as fundamental, saying the brotherly relationship was \"cruelly violated\".\n\nHe set a headline sentence of 13 years which he reduced to ten in consideration of the man’s admissions to gardaí­ and subsequent guilty pleas.\n\nMr Justice White suspended the last two years on condition that Murphy engage with psychological services and victim focused work while in custody and stay under Probation Service supervision for that period.\n\nHe also ordered Murphy to undergo assessment for a sex offender treatment programme.\n\nReading his victim impact statement to court the victim said he had been on a long and horrendous journey.\n\n“When John decided to do what he did to me, he imposed a life sentence on me,” he said. He said Murphy took advantage of a child’s innocence to satisfy his own sexual desire.\n\n“I looked at him as a big brother and a hero. He looked at me as a sexual object. He became my biggest villain,” he said.\n\nHe said his brother groomed him and manipulated him and, as a result, the victim began to pull away from family and friends and became angry and violent in the family home.\n\n“I was lashing out. I was screaming out for help in the wrong way. Every aspect of my life was falling apart,” he said. He said he is now no longer a victim.\n\n“I am a survivor. I am free of his disgusting and sick secret. I give back to John the shame, the loneliness, the resentment, the hatred that he gave to me over 30 years ago. He will carry this burden for the rest of his life,” he said.\n\nEmmet Boyle BL, defending, asked the court to consider the fact that when gardaí­ went to his client with some of the allegations Murphy admitted them and disclosed other incidents of abuse of his brother.\n\nHe said his client was aware of his sexual orientation from a young age but was ashamed of it. Justice White said he accepted Murphy had these difficulties but said that sexual orientation had no impact on and “is no excuse” for abusive behaviour.\n\nJohn Murphy\n\nMr Justice Michael White\n\nIN THIS SECTION\n\nNew law removes potential obstacle to formal complaints about judges’ conduct of family law cases\n\nMother and friend deny Tusla claims of disruption to its efforts to care for children\n\nChronically suicidal girl must get appropriate care place by next week, says High Court president\n\nJohn Gilligan gets suspended sentence and fine in Spanish court after plea deal over drugs and weapons charges\n\nBook of evidence on Sliabh Liag murder charge ‘at advanced stage’\n\nMOST READ\n\nBurning Man: ‘We’re Irish, we’re used to a festival wash-out,’ says Laois man stranded with family\n\nJohn Gilligan comes across as smirking, shifty and unpleasant in Confessions of a Crime Boss\n\n‘Ireland makes it harder to leave. I have tried to leave, but it showed me home is not only what surrounds you’\n\nDoug Beattie: ‘I suddenly found it really difficult to talk to my 13-year-old daughter or my 13-year-old son’\n\nFormer Luke Ming Flanagan assistant to go on trial for tweet about Saoirse McHugh\n\nLATEST STORIES\n\n‘Where is the money?’ Military graft becomes a headache for Ukraine\n\n‘I once travelled up to the Giants Causeway just to eat their toasties’: Readers recommend Ireland’s best sandwich providers\n\nMan (42) released on bail after allegedly headbutting Roy Keane\n\nIrish Open 2023: Tee times, TV details, weather forecast, players to watch\n\nWarm forecast to continue until weekend\n\n© 2023 The Irish Times DAC\n\n© 2023 The Irish Times DAC\n\nSubscribe\n\nWhy Subscribe?\n\nSubscription Bundles\n\nSubscriber Rewards\n\nSubscription Help Centre(Opens in new window)\n\nHome Delivery(Opens in new window)\n\nGift Subscriptions\n\nSupport\n\nContact Us\n\nHelp Centre(Opens in new window)\n\nMy Account\n\nAbout Us\n\nAdvertise\n\nContact Us\n\nThe Irish Times Trust\n\nCareers\n\nIrish Times Products & Services\n\nePaper\n\nCrosswords & puzzles\n\nNewspaper Archive\n\nNewsletters\n\nArticle Index(Opens in new window)\n\nDiscount Codes(Opens in new window)\n\nDownload the app\n\nMyHome.ie(Opens in new window)  •\n\nTop 1000  •\n\nThe Gloss(Opens in new window)  •\n\nRecruit Ireland(Opens in new window)  •\n\nIrish Times Training(Opens in new window)\n\nTerms & Conditions\n\nPrivacy Policy\n\nCookie Information\n\nCookie Settings\n\nCommunity Standards\n\nCopyright"], ["Brave mother, 33, tells of horrific 13-year ordeal as father who raped and \nabused her is jailed", "https://www.dailymail.co.uk/news/article-5977143/Brave-mother-33-tells-horrific-13-year-ordeal-father-raped-abused-jailed.html", "Sophia Murphy (pictured), now 33, waived her anonymity after her father  John was jailed for 18 years for the 'horrendous' sexual abuse of...", "Jul 21, 2018", "Home\n\nU.S.\n\nNews\n\nSport\n\nTV&Showbiz\n\nFemail\n\nFemail\n\nHealth\n\nScience\n\nMoney\n\nVideo\n\nCoffee Break\n\nTravel\n\nColumnists\n\nBreaking News\n\nAustralia\n\nVideo\n\nRussia-Ukraine\n\nChina\n\nDebate\n\nMeghan Markle\n\nPrince Harry\n\nKing Charles III\n\nWeather\n\nMost read\n\nMy Profile\n\nLogout\n\nLogin\n\n2PM\n\n5PM\n\n5-Day Forecast\n\nAdvertisement\n\nNo10 sends Education Secretary Gillian Keegan out to apologise for hot mic rant where she accused everyone of 'sitting on their a***' over concrete chaos only to blame the SCHOOLS for slow response - as aides reveal she was in Spain when crisis erupted\n\nTragic five-year-old boy who was sent out alone to buy sweets for family picnic was crushed under wheels of van after bending down to tie his shoelaces: Man who failed to see him is found guilty of causing his death\n\nUS man living in Scotland sends Britons into meltdown with long list of complaints about UK life - from homes without air conditioning to not celebrating the 4th of July\n\nMan United star Antony's ex-girlfriend Gabriela Cavallin accuses him of threatening her while pregnant, damaging her breast implants and slicing her finger with a glass\n\nBritain's best takeaways revealed: Uber Eats share the top rated restaurants in every region, including burger, burrito and jerk chicken shops - so is YOUR favourite on the list?\n\nWorld's first inland surfing park Adventure Parc Snowdonia is forced to CLOSE just eight years after first opening... after its wave machine kept breaking down\n\nWorld's most body confident countries revealed: Malta tops the global league table - while Britons are named some of the least happy with their figures\n\nBodyguards could be brought in by Sky for their pundits after Roy Keane was 'headbutted' by a fan during Arsenal's win over Man United... as the broadcaster looks at what measures they can take to keep them safe\n\n'Miracle' weight loss jab Wegovy launches on the NHS in 'limited' supply - but private patients could have to pay up to £300 for a dose\n\n'Things I ate this morning': Kate Lawler defiantly shows off her cream tea and sandwich lunch after cruel trolls criticised her weight\n\nLocals snub £5,000 compensation to have 'monstrous' 700ft pylons that are as high as The Shard installed near their homes\n\nFish attacks off Benidorm are leaving 15 people injured every day - as experts reveal why they are targeting certain swimmers...\n\nPictured: 'Kind and gentle' hospital support worker, 47, who died in 'Coventry car rampage' while cycling home from night shift - as man, 33, is arrested and detained under the Mental Health Act\n\nMigrant gives thumbs up (while another flashes a V sign) as group is driven away from Border Force compound in Dover - and number of asylum seekers arriving in UK tops 21,000 this year\n\nFears are growing for missing woman, 26, who vanished on her way home from work - as police partially seal off a Tesco supermarket\n\nIs Prince Albert's ex-mistress edging into the gap left by absent Princess Charlene? Nicole Coste has been spending more time than ever with Monaco royal - amid reports his wife is 'living in Switzerland'\n\nSchool concrete crisis deepens as primary warns disruption could last until 2025 and parents across the UK are told buildings will remain shut until further notice and children must stay home - just HOURS before the start of term\n\nFears schools could be out of action until 2024 as portacabins and marquees are shipped in to replace crumbling classrooms plagued with RAAC and pupils return to lockdown learning\n\nThe rain in Spain: Madrid's metro system is flooded as city is hit by worst rainfall since 1972 as weather warnings are placed across the country and two people are killed\n\nRevealed: List of schools fully or partially CLOSED over RAAC safety fears\n\n'So when you're not all sitting on your a***s all day, what are YOUR favourite subjects?': Twitter users mock Gillian Keegan's hot mic gaffe as Education Secretary comes under fire over schools concrete chaos\n\nRevenge of the Blairites? Keir Starmer placates Angela Rayner with shadow deputy PM title as he uses pre-election reshuffle to put New Labour veterans in key posts - with Hilary Benn making a comeback\n\nI'm a flight attendant - NOTHING irritates me more than this\n\nRishi Sunak 'poised to drop effective ban on new onshore wind farms' as Tories squabble over planning rules and Net Zero drive\n\nPrevious\n\nNext\n\n'He took my innocence, my childhood and my voice': Brave mother, 33, tells of horrific 13-year ordeal as father who raped and abused her from the age of three is jailed for 18 years\n\nSophie Murphy waived her anonymity after father John was jailed for 18 years\n\nHer father, 61, pleaded guilty to raping, indecent assault and sexual assault\n\nMs Murphy said that 'silence protects the abuser and imprisons the victim'\n\nBy Fiona Ferguson For The Irish Daily Mail\n\nUpdated:  10:11 BST, 21 July 2018\n\n\n\n\n\n\n\n\n\n\n\ne-mail\n\n\n\nshares\n\nA woman who was raped and sexually assaulted by her father during more than a decade of abuse has spoken out and said he had 'stripped me of my childhood'.\n\nSophia Murphy, now 33, waived her anonymity after her father John was jailed for 18 years for the ‘horrendous’ sexual abuse of his daughter from the age of three to 15.\n\nFormer Defence Forces member Murphy, 61, pleaded guilty to the rape, indecent assault and sexual assault of his eldest daughter at locations in Co. Galway and Co. Mayo between 1988 and 2001.\n\nHe also admitted to a final incident of sexual assault of Ms Murphy in 2010.\n\nSophia Murphy, pictured outside court yesterday, waived her anonymity after her father John was jailed for 18 years for the ‘horrendous’ sexual abuse of his daughter\n\nIn her victim impact statement, which she read to the court, Ms Murphy said that she wished to go public to encourage other people in her position to come forward.\n\n‘Silence protects the abuser and imprisons the victim,’ she told the Central Criminal Court. ‘Take back your life; break the silence. You are not a victim for sharing your story; you are a survivor.’\n\nAddressing her father during her statement: ‘Dad, you stripped me of every human right, my worth, my privacy, my energy, my time, my confidence, my innocence, my childhood, my education, my teenage years, a normal life, even my own voice – until today. There is not a day in my life I don’t remember you abusing me.’\n\nHer father, formerly of Nephin View Manor, Foxford, Co. Mayo, is currently serving an eight-year sentence in Arbour Hill prison in Dublin, for sexual abuse involving Ms Murphy’s two younger sisters, imposed last February at Castlebar Circuit Court.\n\nRELATED ARTICLES\n\nPrevious\n\n1\n\nNext\n\nCare home boss threw water in resident's face because she...    Foster parents CAN hug their children, ministers say as new...\n\nShare this article\n\nShare\n\nMs Murphy, now aged 33, was aged between three and 15 years of age at the time of the majority of the offences. She has waived her right to anonymity so her father can be named.\n\nJailing her father, Mr Justice Michael White no"], ["Remembering justice for victims of sex predator John Merzbacher 25 years \nlater | COMMENTARY", "https://www.baltimoresun.com/opinion/op-ed/bs-ed-op-0612-merzbacher-verdict-anniversary-20200611-qlhvue26yzdrxf5cmsau6sfun4-story.html", "This week marks the 25th anniversary of the guilty verdict of John  Merzbacher, a former schoolteacher convicted of the rape of Elizabeth...", "Jun 11, 2020", "This website stores data such as cookies to enable essential site functionality, as well as marketing, personalization, and analytics. By remaining on this website, you indicate your consent.\n\nCookie Policy\n\nSubscriber Services(Opens in new window)Subscribe here(Opens in new window)Manage subscription(Opens in new window)EZ Pay(Opens in new window)Vacation Stop(Opens in new window)Benefits of subscribing(Opens in new window)Sun Insider\n\nRead today's newspaper(Opens in new window)Baltimore Sun(Opens in new window)Evening Edition(Opens in new window)Carroll County Times(Opens in new window)Capital Gazette(Opens in new window)The Aegis(Opens in new window)Carroll Evening Edition(Opens in new window)\n\nAdvertise With Us(Opens in new window)\n\nLatest\n\nMaryland Anne Arundel CountyBaltimore CityBaltimore CountyCarroll CountyHarford CountyHoward CountyCrimeEducationSun InvestigatesEnvironment\n\nMarijuana\n\nNation & World\n\nSportsBaltimore OriolesBaltimore RavensCollege SportsHigh School sportsSports AnalysisTerpsHorse Racing\n\nBusinessConsumer ReviewsAutos(Opens in new window)Real EstateTop Workplaces 2022Best Reviews(Opens in new window)\n\nPoliticsElections\n\nHealthCoronavirus\n\nEntertainmentMoviesArtsMusicEvents(Opens in new window)TVTV ScheduleHoroscopesComics\n\nFeaturesNewsmakerHot PropertiesHomeTravelRetro Baltimore\n\nFood & Drink\n\nCalendar\n\nFun & Games(Opens in new window)Horoscopes(Opens in new window)Jumble Daily(Opens in new window)Daily Crossword(Opens in new window)Solitaire(Opens in new window)Bubble Shooter HD(Opens in new window)\n\nObituariesDeath Notices(Opens in new window)Editorial ObituariesPlace a Notice(Opens in new window)\n\nOpinionEditorialReaders RespondOp-edColumnistsSubmit letter to the editor(Opens in new window)Submit an op-ed(Opens in new window)\n\nWeather\n\nPhotosPicturing Maryland(Opens in new window)\n\nAboutContact UsHelp CenterAwardsSpecial sections(Opens in new window)2023 interns(Opens in new window)Mary J. Corey Internship(Opens in new window)About our ads(Opens in new window)RSS\n\nBranded ContentAdvertising by Ascend(Opens in new window)Paid content by Brandpoint(Opens in new window)Paid Partner Content(Opens in new window)\n\nMore(Opens in new window)Archives(Opens in new window)Reprints & Licensing(Opens in new window)ClassifiedsEn españolPrivacy Policy(Opens in new window)Public Notices(Opens in new window)TAG disclosure(Opens in new window)Terms of Service(Opens in new window)The Sun Store\n\nAdvertisement\n\nOp-ed\n\nRemembering justice for victims of sex predator John Merzbacher 25 years later | COMMENTARY\n\nBy \n\nNancy Fenton\n\nFor The Baltimore Sun\n\nFormer sexually abused students of John Joseph Merzbacher and some of their family members stand in support two years ago to keep Merzbacher in prison after the sexual abuse that took place 40 years ago at the Catholic Community Middle School in Locust Point. (Lloyd Fox/Baltimore Sun)\n\nThis week marks the 25th anniversary of the guilty verdict of John Merzbacher, a former schoolteacher convicted of the rape of Elizabeth Murphy in the 1970s, when she was a student at the Catholic Community Middle School in South Baltimore.\n\nA Baltimore City jury found the teacher guilty in 1994, after Ms. Murphy was an adult, of eight charges of rape and abuse. Following the guilty verdict, prosecutors dropped an additional 100 charges involving 13 other former students, who were prepared to go to trial against Merzbacher. Eventually, he was sentenced to four life sentences plus 10 years. He is now serving time in a Maryland prison.\n\nAdvertisement\n\nI clearly remember the breaking news of the guilty verdict. The small TV on my kitchen countertop was turned on. I was tinkering in the kitchen, while my young daughter played at the table. A jury member commented on Liz’s overwhelming testimony and the consideration of the facts presented to the jury. I was stunned by the news, knowing deep in my heart that there was still so much to tell about the terror inflicted by just that one person.\n\nPrior to teaching in the Catholic school, John Merzbacher taught in Baltimore City’s public schools, where he sexually abused me and other students. (He has not been charged in those cases, and has always claimed that he’s innocent, even after being convicted in Ms. Murphy’s case). His actions in the public school were a precursor of what was to happen in the Catholic school.\n\nAdvertisement\n\nMany years later, Liz and I decided to meet. Over coffee, we finished each other’s sentences in describing our shared abuse experiences at the hands of John Merzbacher. To this day, Liz is faith-filled and kind, despite the atrocities inflicted upon her.\n\nUnfortunately, statistics show that most cases of child sexual abuse are not disclosed until the average age of 52 years. This lag in time speaks to the psychological toll of sexual abuse. Long after the physical threat ends, people like me struggle to find their voices and entrust others with information about their experiences. Current research from the Maryland Coalition Against Sexual Assault (MCASA) reveals that in 2015, 24% of children in Maryland were sexually abused. That is nearly one in five children living in our own state. MCASA also reports that only 12-30% of child sexual abuse cases are reported to authorities.\n\nAll too often, perpetrators thrive in a culture of silence that they and those around them create to retain their power. This silence must be broken for sexual abuse to end. Here is what must be done:\n\n1. Educate children about sexual abuse. Provide age appropriate discussions so children learn about personal boundaries and know that it is OK to tell a trusted adult about their concerns.\n\n2. Monitor your child’s social media activity. Online child pornography and the recording of abuse is a growing trend that overwhelms law enforcement agencies.\n\n3. Report suspected cases of child sexual abuse. Do not hesitate to call 911 or 410-361-2235 for Baltimore City Child Protective Services.\n\n4. Advocate for the complete elimination of the statute of limitations (SOL) for cases of past sexual abuse. SOLs do not guarantee justice, but they provide an important opportunity for victims to hold institutions responsible for past incidences sexual abuse.\n\nThis week’s anniversary offers a unique bench mark for the many Baltimoreans who crossed paths with John Merzbacher. This includes direct victims, the students who witnessed his abuse, and all of those who knew him as a teacher and union worker. I am grateful to former Merzbacher students Liz Murphy and Linda Tiburzi, who continue to share their experiences so that others may find hope and reconciliation.\n\nAdvertisement\n\nFor me, this week offers an opportunity to reflect on all that has happened in the past 25 years. The act of sexual abuse has come out of the closet. The social sciences have documented the potential long-term impact of childhood trauma and its societal costs. Laws have strengthened, and victim impact statements are part of the judicial "]]